Revit 2027 API
FilterCategoryRule.GetCategories Method
 Gets the rule's categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetCategories()
Public Function GetCategories As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetCategories()
member GetCategories : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
See Also
Reference
FilterCategoryRule Class
Autodesk.Revit.DB Namespace